src/cf/Documents/CRM_РассылкаЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>CRM_РассылкаЭлектронныхПисем</Name>
			<BasedOn>
				<xr:Item>Catalog.МаркетинговыеМероприятия</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Завершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
						<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресХранилищаФайлов</Name>
					<Comment>Служебный реквизит, используется для механизма шаблонов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьПисьмаСразу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ШаблоныОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеЗаказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзHTMLФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыполненияРассылки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКлиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеАдреса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Принадлежность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПартнерСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СвоиЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеАдреса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеАдреса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/НазначениеОпросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>НазначениеОпросов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРеспондентов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможностьПредварительногоСохранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободныйОпрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВАрхивеАнкет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Респонденты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Респондент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/ВнешниеПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ВнешниеПользователи</Name>
			<Comment>Не переносить в объединенные решения</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАвторизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВнешнийПользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьРолиНепосредственно</Name>
					<Comment>Используется, если не встроена подсистема "Управление доступом"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/CRM_РассылкаЭлектронныхПисем/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьПоНазначениюОпросов(ДанныеЗаполнения)
	
	Тема			= "Приглашение к анкетированию";
	//Ответственный	= ДанныеЗаполнения.Ответственный;
	Основание		= ДанныеЗаполнения.Основание;
	
	Если ДанныеЗаполнения.РассылкаТолькоДляНовых Тогда
		
		// Получим список респондентов, которым уже отправлено приглашение.
		ЗапросПоРассылкам = Новый Запрос;
		
		Если ТипЗнч(Основание.ТипРеспондентов) = Тип("СправочникСсылка.Партнеры") Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	CRM_РассылкаЭлектронныхПисемПолучатели.Партнер КАК Респондент
			               |ИЗ
			               |	Документ.CRM_РассылкаЭлектронныхПисем.Получатели КАК CRM_РассылкаЭлектронныхПисемПолучатели
			               |ГДЕ
			               |	CRM_РассылкаЭлектронныхПисемПолучатели.Ссылка.Основание = &Основание";
			
		ИначеЕсли ТипЗнч(Основание.ТипРеспондентов) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	CRM_РассылкаЭлектронныхПисемПолучатели.КонтактноеЛицо КАК Респондент
			               |ИЗ
			               |	Документ.CRM_РассылкаЭлектронныхПисем.Получатели КАК CRM_РассылкаЭлектронныхПисемПолучатели
			               |ГДЕ
			               |	CRM_РассылкаЭлектронныхПисемПолучатели.Ссылка.Основание = &Основание";
			
		Иначе
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	CRM_РассылкаЭлектронныхПисемСвоиЛица.Пользователь КАК Респондент
			               |ИЗ
			               |	Документ.CRM_РассылкаЭлектронныхПисем.СвоиЛица КАК CRM_РассылкаЭлектронныхПисемСвоиЛица
			               |ГДЕ
			               |	CRM_РассылкаЭлектронныхПисемСвоиЛица.Ссылка.Основание = &Основание";
			
		КонецЕсли;	
		
		ЗапросПоРассылкам.Текст = ТекстЗапроса;
		ЗапросПоРассылкам.УстановитьПараметр("Основание", Основание);
		
		ТаблицаРезультатовЗапросаПоРассылкам = ЗапросПоРассылкам.Выполнить().Выгрузить();
		
		МассивРеспондентовИсключений = ТаблицаРезультатовЗапросаПоРассылкам.ВыгрузитьКолонку("Респондент");
		
	Иначе
		
		МассивРеспондентовИсключений = Новый Массив;
		
	КонецЕсли;	
	
	Если Основание.СвободныйОпрос Тогда
		
		ЗапросПоРеспондентам = Новый Запрос;
		
		Если ТипЗнч(Основание.ТипРеспондентов) = Тип("СправочникСсылка.Пользователи") Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ВнешниеПользователи.ОбъектАвторизации КАК Респондент
			               |ИЗ
			               |	Справочник.ВнешниеПользователи КАК ВнешниеПользователи
			               |ГДЕ
			               |	ВнешниеПользователи.ОбъектАвторизации ССЫЛКА Справочник.Пользователи
			               |	И НЕ(ВнешниеПользователи.ОбъектАвторизации В (&РеспондентыИсключения))";
			
		ИначеЕсли ТипЗнч(Основание.ТипРеспондентов) = Тип("СправочникСсылка.Партнеры") Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ВнешниеПользователи.ОбъектАвторизации КАК Респондент
			               |ИЗ
			               |	Справочник.ВнешниеПользователи КАК ВнешниеПользователи
			               |ГДЕ
			               |	ВнешниеПользователи.ОбъектАвторизации ССЫЛКА Справочник.Партнеры
			               |	И НЕ(ВнешниеПользователи.ОбъектАвторизации В (&РеспондентыИсключения))";
			
		ИначеЕсли ТипЗнч(Основание.ТипРеспондентов) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ВнешниеПользователи.ОбъектАвторизации КАК Респондент
			               |ИЗ
			               |	Справочник.ВнешниеПользователи КАК ВнешниеПользователи
			               |ГДЕ
			               |	ВнешниеПользователи.ОбъектАвторизации ССЫЛКА Справочник.КонтактныеЛицаПартнеров
			               |	И НЕ(ВнешниеПользователи.ОбъектАвторизации В (&РеспондентыИсключения))";
			
		КонецЕсли;
		
		Если ДанныеЗаполнения.РассылкаТолькоДляНовых Тогда
			
			ЗапросПоРеспондентам.УстановитьПараметр("РеспондентыИсключения", МассивРеспондентовИсключений);
			
		Иначе
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И НЕ(ВнешниеПользователи.ОбъектАвторизации В (&РеспондентыИсключения))", "");
			
		КонецЕсли;	
				
		ЗапросПоРеспондентам.Текст = ТекстЗапроса;        
		
		ВыборкаПоРеспондентам = ЗапросПоРеспондентам.Выполнить().Выбрать();		
		
		Пока ВыборкаПоРеспондентам.Следующий() Цикл
			
			Если ТипЗнч(Основание.ТипРеспондентов) = Тип("СправочникСсылка.Пользователи") Тогда
				
				НоваяСтрока					= СвоиЛица.Добавить();
				НоваяСтрока.Пользователь	= ВыборкаПоРеспондентам.Респондент;
				
				Таб = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(НоваяСтрока.Пользователь, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				
				Если Таб.Количество() > 0 Тогда
					НоваяСтрока.Адрес = Таб[0].АдресЭП;
					НоваяСтрока.ПредставлениеАдреса	= Строка(НоваяСтрока.Пользователь) + " <" + Таб[0].Представление + ">";
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока = Получатели.Добавить();
				
				Если ТипЗнч(Основание.ТипРеспондентов) = Тип("СправочникСсылка.Партнеры") Тогда
					
					НоваяСтрока.Партнер = ВыборкаПоРеспондентам.Респондент;
					НоваяСтрока.КонтактноеЛицо = ВыборкаПоРеспондентам.Респондент.CRM_ОсновноеКонтактноеЛицо;					
				
				Иначе
					
					НоваяСтрока.Партнер = ВыборкаПоРеспондентам.Респондент.Владелец;
					НоваяСтрока.КонтактноеЛицо = ВыборкаПоРеспондентам.Респондент;
					
				КонецЕсли;
				
				Таб = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюОбъекта(НоваяСтрока.Партнер,
													?(ЗначениеЗаполнено(НоваяСтрока.КонтактноеЛицо),НоваяСтрока.КонтактноеЛицо,Неопределено),
													Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Неопределено);
				Если Таб.Количество() > 0 Тогда
					НоваяСтрока.Адрес = Таб[0].АдресЭП;
					НоваяСтрока.ПредставлениеАдреса	= ?(Таб[0].Ссылка = НоваяСтрока.Партнер,Строка(НоваяСтрока.Партнер),Строка(НоваяСтрока.КонтактноеЛицо)) + " <" + Таб[0].Представление + ">";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ЗапросПоРеспондентам = Новый Запрос;
		
		ЗапросПоРеспондентам.Текст = "ВЫБРАТЬ
		                             |	НазначениеОпросовРеспонденты.Респондент КАК Респондент
		                             |ИЗ
		                             |	Документ.НазначениеОпросов.Респонденты КАК НазначениеОпросовРеспонденты
		                             |ГДЕ
		                             |	НазначениеОпросовРеспонденты.Ссылка = &НазначениеОпросов
		                             |	И НЕ(НазначениеОпросовРеспонденты.Респондент В (&РеспондентыИсключения))";
									 
		
		Если ДанныеЗаполнения.РассылкаТолькоДляНовых Тогда
			
			ЗапросПоРеспондентам.УстановитьПараметр("РеспондентыИсключения", МассивРеспондентовИсключений);
			
		Иначе
			
			ЗапросПоРеспондентам.Текст = СтрЗаменить(ЗапросПоРеспондентам.Текст, "И НЕ(НазначениеОпросовРеспонденты.Респондент В (&РеспондентыИсключения))", "");
			
		КонецЕсли;				
									 
		ЗапросПоРеспондентам.УстановитьПараметр("НазначениеОпросов", Основание);
		
		ВыборкаПоРеспондентам = ЗапросПоРеспондентам.Выполнить().Выбрать();		
		
		Пока ВыборкаПоРеспондентам.Следующий() Цикл
			
			Если ТипЗнч(Основание.ТипРеспондентов) = Тип("СправочникСсылка.Пользователи") Тогда
				
				НоваяСтрока					= СвоиЛица.Добавить();
				НоваяСтрока.Пользователь	= ВыборкаПоРеспондентам.Респондент;
				
				Таб = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(НоваяСтрока.Пользователь, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				
				Если Таб.Количество() > 0 Тогда
					НоваяСтрока.Адрес = Таб[0].АдресЭП;
					НоваяСтрока.ПредставлениеАдреса	= Строка(НоваяСтрока.Пользователь) + " <" + Таб[0].Представление + ">";
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока = Получатели.Добавить();
				
				Если ТипЗнч(Основание.ТипРеспондентов) = Тип("СправочникСсылка.Партнеры") Тогда
					
					НоваяСтрока.Партнер = ВыборкаПоРеспондентам.Респондент;
					НоваяСтрока.КонтактноеЛицо = ВыборкаПоРеспондентам.Респондент.CRM_ОсновноеКонтактноеЛицо;					
				
				Иначе
					
					НоваяСтрока.Партнер = ВыборкаПоРеспондентам.Респондент.Владелец;
					НоваяСтрока.КонтактноеЛицо = ВыборкаПоРеспондентам.Респондент;
					
				КонецЕсли;
				
				Таб = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюОбъекта(НоваяСтрока.Партнер,
													?(ЗначениеЗаполнено(НоваяСтрока.КонтактноеЛицо),НоваяСтрока.КонтактноеЛицо,Неопределено),
													Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Неопределено);
				Если Таб.Количество() > 0 Тогда
					НоваяСтрока.Адрес = Таб[0].АдресЭП;
					НоваяСтрока.ПредставлениеАдреса	= ?(Таб[0].Ссылка = НоваяСтрока.Партнер,Строка(НоваяСтрока.Партнер),Строка(НоваяСтрока.КонтактноеЛицо)) + " <" + Таб[0].Представление + ">";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	АдресWebДоступа = Константы.CRM_АдресWebДоступа.Получить();
	
	Если ПустаяСтрока(АдресWebДоступа) Тогда
	
		АдресWebДоступа = "{адрес web-доступа в настройках системы не заполнен}";
		
	КонецЕсли;
	
	Организация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация");
	
	НаименованиеОрганизации = ?(ПустаяСтрока(Организация.НаименованиеПолное), Организация.Наименование, Организация.НаименованиеПолное);
	
	Тема = "Приглашение к анкетированию";
	
	ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
	
	ТекстHTML = Основание.ШаблонАнкеты.CRM_ШаблонРассылки.Текст;
	Текст = Взаимодействия.ПолучитьОбычныйТекстИзHTML(ТекстHTML);
	
КонецПроцедуры

Процедура ЗаполнитьПоМаркетинговойКампании(ДанныеЗаполнения)
	
	ВыбранныеАдресаЭП 	= Неопределено;
	СписокПартнеров		= Неопределено;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("МаркетинговаяКампания") Тогда
		
		Если ДанныеЗаполнения.Свойство("ВыбранныеАдресаЭП") Тогда
		 
		 	ВыбранныеАдресаЭП	= ДанныеЗаполнения.ВыбранныеАдресаЭП;
		 
		ИначеЕсли ДанныеЗаполнения.Свойство("СписокПартнеров") Тогда
			
		 	СписокПартнеров	= ДанныеЗаполнения.СписокПартнеров;
			
		КонецЕсли; 

		 ДанныеЗаполнения = ДанныеЗаполнения.МаркетинговаяКампания;
		 
	КонецЕсли;

	Тема					= ДанныеЗаполнения.Наименование;
	Ответственный			= ДанныеЗаполнения.Ответственный;
	Проект					= ДанныеЗаполнения.CRM_Проект;
	Подразделение			= ДанныеЗаполнения.CRM_Подразделение;
	Основание				= ДанныеЗаполнения;
	
	Если ЗначениеЗаполнено(ВыбранныеАдресаЭП) Тогда
	
		Для Каждого СтрокаТЧ Из ВыбранныеАдресаЭП Цикл
			НоваяСтрока = Получатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
			НоваяСтрока.Партнер			= СтрокаТЧ.Значение;
			НоваяСтрока.КонтактноеЛицо	= ДанныеЗаполнения.КонтактноеЛицо;
			
		КонецЦикла;
	
	ИначеЕсли ЗначениеЗаполнено(СписокПартнеров) Тогда
		
		мДобавленные = Новый Массив;
		Для Каждого элСп Из СписокПартнеров Цикл
			элСп = элСп.Значение;
			Если ЗначениеЗаполнено(элСп.Партнер) Тогда
				Таб = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюОбъекта(элСп.Партнер, 
					?(ЗначениеЗаполнено(элСп.КонтактноеЛицо), элСп.КонтактноеЛицо, Неопределено),
					Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Неопределено);
				Если Таб.Количество() > 0 Тогда
					АдресЭП = Таб[0].АдресЭП;
					ПредставлениеАдреса	= ?(Таб[0].Ссылка = элСп.Партнер,Строка(элСп.Партнер),Строка(элСп.КонтактноеЛицо)) + " <" + Таб[0].Представление + ">";
					бДоб = мДобавленные.Найти(АдресЭП);									
					Если бДоб = Неопределено И ЗначениеЗаполнено(АдресЭП) Тогда
						мДобавленные.Добавить(АдресЭП);
						НоваяСтрока = Получатели.Добавить();
						НоваяСтрока.Партнер			= элСп.Партнер;
						НоваяСтрока.КонтактноеЛицо	= элСп.КонтактноеЛицо;
						НоваяСтрока.Адрес = АдресЭП;
						НоваяСтрока.ПредставлениеАдреса	= ПредставлениеАдреса;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
		
	Иначе
	
		Для Каждого СтрокаТЧ Из ДанныеЗаполнения.ПартнерыИКонтактныеЛица Цикл
			НоваяСтрока = Получатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
			
			Таб = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюОбъекта(НоваяСтрока.Партнер,
												?(ЗначениеЗаполнено(НоваяСтрока.КонтактноеЛицо),НоваяСтрока.КонтактноеЛицо,Неопределено),
												Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Неопределено);
			Если Таб.Количество() > 0 Тогда
				НоваяСтрока.Адрес = Таб[0].АдресЭП;
				НоваяСтрока.ПредставлениеАдреса	= ?(Таб[0].Ссылка = НоваяСтрока.Партнер,Строка(НоваяСтрока.Партнер),Строка(НоваяСтрока.КонтактноеЛицо)) + " <" + Таб[0].Представление + ">";
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаТЧ Из ДанныеЗаполнения.CRM_СвоиУчастники Цикл
			Если ТипЗнч(СтрокаТЧ.Участник) = Тип("СправочникСсылка.Пользователи") Тогда
				
				НоваяСтрока					= СвоиЛица.Добавить();
				НоваяСтрока.Пользователь	= СтрокаТЧ.Участник;
				
				Таб = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(НоваяСтрока.Пользователь, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				
				Если Таб.Количество() > 0 Тогда
					НоваяСтрока.Адрес = Таб[0].АдресЭП;
					НоваяСтрока.ПредставлениеАдреса	= Строка(НоваяСтрока.Пользователь) + " <" + Таб[0].Представление + ">";
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(СтрокаТЧ.Участник) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				
				НоваяСтрока			= ФизЛица.Добавить();
				НоваяСтрока.ФизЛицо	= СтрокаТЧ.Участник;
				
				Таб = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(НоваяСтрока.ФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				
				Если Таб.Количество() > 0 Тогда
					НоваяСтрока.Адрес = Таб[0].АдресЭП;
					НоваяСтрока.ПредставлениеАдреса	= Строка(НоваяСтрока.ФизЛицо) + " <" + Таб[0].Представление + ">";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли; 
		
КонецПроцедуры

Процедура ЗаполнитьПоСпискуПартнеров(ДанныеЗаполнения)
	
	ДанныеЗаполнения = ДанныеЗаполнения.СписокПартнеров;
	мДобавленные = Новый Массив;
	Для каждого элСп Из ДанныеЗаполнения Цикл
		элСп = элСп.Значение;
		Если ЗначениеЗаполнено(элСп.Партнер) Тогда

			Таб = CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюОбъекта(элСп.Партнер,
												?(ЗначениеЗаполнено(элСп.КонтактноеЛицо),элСп.КонтактноеЛицо,Неопределено),
												Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Неопределено);
												
			Если Таб.Количество() > 0 Тогда
					
				АдресЭП = Таб[0].АдресЭП;
				ПредставлениеАдреса	= ?(Таб[0].Ссылка = элСп.Партнер,Строка(элСп.Партнер),Строка(элСп.КонтактноеЛицо)) + " <" + Таб[0].Представление + ">";
				бДоб = мДобавленные.Найти(АдресЭП);									
				Если бДоб = Неопределено И ЗначениеЗаполнено(АдресЭП) Тогда
					
					мДобавленные.Добавить(АдресЭП);
					НоваяСтрока = Получатели.Добавить();
					НоваяСтрока.Партнер			= элСп.Партнер;
					НоваяСтрока.КонтактноеЛицо	= элСп.КонтактноеЛицо;
					НоваяСтрока.Адрес = АдресЭП;
					НоваяСтрока.ПредставлениеАдреса	= ПредставлениеАдреса;
					
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Кодировка) Тогда
		Кодировка = "utf-8";
	КонецЕсли;
	
	CRM_ОбщегоНазначенияСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.МаркетинговыеМероприятия") 
		ИЛИ (ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("МаркетинговаяКампания")) Тогда
		ЗаполнитьПоМаркетинговойКампании(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Основание") 
		И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.НазначениеОпросов") Тогда
		
		ЗаполнитьПоНазначениюОпросов(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("СписокПартнеров") Тогда
		ЗаполнитьПоСпискуПартнеров(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Партнер") Тогда
		СтруктураПартнера = Новый Структура;
		СтруктураПартнера.Вставить("Партнер",			ДанныеЗаполнения.Партнер);
		СтруктураПартнера.Вставить("КонтактноеЛицо",	Неопределено);
		СписокПартнеров = Новый СписокЗначений;
		СписокПартнеров.Добавить(СтруктураПартнера);
		ДанныеЗаполнения.Вставить("СписокПартнеров", СписокПартнеров);
		ЗаполнитьПоСпискуПартнеров(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
			CRM_ОбщегоНазначенияСервер.ЗаполнитьОбъектБизнесПроцесса(ЭтотОбъект, ДанныеЗаполнения);
		Иначе
			CRM_ОбщегоНазначенияСервер.ЗаполнитьОбъектБизнесПроцесса(ЭтотОбъект, ДанныеЗаполнения.БизнесПроцесс, ДанныеЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("УчетнаяЗапись") Тогда
		
		УчетнаяЗапись = ДанныеЗаполнения.УчетнаяЗапись;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Проект") Тогда
		
		Проект = ДанныеЗаполнения.Проект;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Ответственный") Тогда
		
		Ответственный = ДанныеЗаполнения.Ответственный;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Тема") Тогда
		
		Тема = ДанныеЗаполнения.Тема;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Важность") Тогда
		
		Важность = ДанныеЗаполнения.Важность;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЕстьВложения") Тогда
		
		Важность = ДанныеЗаполнения.ЕстьВложения;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипТекста) Тогда
		ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// Прикрепленные файлы при копировании.
	Если ОбъектКопирования.ЕстьВложения Тогда
		Основание = ОбъектКопирования.Ссылка;
	КонецЕсли;	
	
	// Заполним автора и ответственного.
	CRM_ОбщегоНазначенияСервер.ЗаполнитьАвтораИОтветственного(ЭтотОбъект);
	
	Завершена 	  = Ложь;
	ЕстьИзменения = Ложь;
	
КонецПроцедуры

#КонецЕсли
